app/Controllers/Admin.php

    public function dashboard()
    {
        $studentCount = (new StudentModel())->countAllResults();
        $courseCount  = (new CourseModel())->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `students`
SELECT COUNT(*) AS `numrows`
FROM `courses`