app/Controllers/Auth.php

    public function attempt()
    {
        $username = trim($this->request->getPost('username') ?? '');
        $password = (string) $this->request->getPost('password');

        if ($username === '' || $password === '') {
            return redirect()->back()->with('error', 'Isi username dan password.')->withInput();
        }

        $userM = new UserModel();

        // login pakai username (atau email juga boleh kalau mau)
        $user = $userM->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1