app/Controllers/Course.php

SELECT *
FROM `courses`
ORDER BY `course_code`
---
    public function index()
    {
        $model = new CourseModel();
        return view('admin/courses/index', [
            'courses' => $model->orderBy('course_code')->findAll()
        ]);