app/Controllers/Enroll.php

SELECT *
FROM `students`
WHERE `user_id` = 3
 LIMIT 1
SELECT *
FROM `courses`
ORDER BY `course_code`
SELECT `course_id`, `course_id`
FROM `takes`
WHERE `student_id` = '2'
SELECT *
FROM `courses`
WHERE `course_id` IN ('3','7')
ORDER BY `course_code`
---
    public function index()
    {
        $userId  = session()->get('user_id');
        $student = (new StudentModel())->where('user_id', $userId)->first();
        if (!$student) {
            return redirect()->to('/login')->with('error', 'Data student tidak ditemukan.');
        }

        $courseM = new CourseModel();
        $takeM   = new TakeModel();

        // semua course
        $courses = $courseM->orderBy('course_code')->findAll();

        // id course yang sudah diambil
        $takenIds = $takeM->select('course_id')
                          ->where('student_id', $student->student_id)
                          ->findColumn('course_id') ?? [];

        // daftar course yang sudah diambil
        $takenCourses = !empty($takenIds)
            ? $courseM->whereIn('course_id', $takenIds)->orderBy('course_code')->findAll()