app/Controllers/Student.php

SELECT `students`.*, `users`.`full_name`, `users`.`username`, `users`.`email`
FROM `students`
LEFT JOIN `users` ON `users`.`user_id` = `students`.`user_id`
ORDER BY `nim`
---
    public function index()
    {
        $m = new StudentModel();
        return view('students/index', [
            'students' => $m->withUser()->orderBy('nim')->findAll(),
        ]);