app/Controllers/StudentArea.php

    private function currentStudent(): ?object
    {
        $uid = $this->currentUserId();
        if (!$uid) return null;
        return (new StudentModel())->withUser()
            ->where('students.user_id', $uid)->first();
---
SELECT `students`.*, `users`.`full_name`, `users`.`username`, `users`.`email`
FROM `students`
LEFT JOIN `users` ON `users`.`user_id` = `students`.`user_id`
WHERE `students`.`user_id` = 3
 LIMIT 1