app/Models/TakeModel.php

    public function byStudentWithCourse(int $studentId): array
    {
        return $this->select('takes.*, courses.course_code, courses.course_name, courses.credits')
                    ->join('courses', 'courses.course_id = takes.course_id', 'left')
                    ->where('takes.student_id', $studentId)
                    ->orderBy('courses.course_code', 'ASC')
                    ->findAll();
---
SELECT `takes`.*, `courses`.`course_code`, `courses`.`course_name`, `courses`.`credits`
FROM `takes`
LEFT JOIN `courses` ON `courses`.`course_id` = `takes`.`course_id`
WHERE `takes`.`student_id` = 2
ORDER BY `courses`.`course_code` ASC